## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: gcp/prod
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place

Terraform will perform the following actions:

  # kubernetes_annotations.cinema will be updated in-place
!   resource "kubernetes_annotations" "cinema" {
!       annotations = {
+           "mesh.cloud.google.com/proxy" = jsonencode(
                {
+                   managed = "true"
                }
            )
        }
        id          = "apiVersion=v1,kind=Namespace,name=cinema"
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # kubernetes_manifest.argocd-gateway will be created
+   resource "kubernetes_manifest" "argocd-gateway" {
+       manifest = {
+           apiVersion = "networking.istio.io/v1beta1"
+           kind       = "Gateway"
+           metadata   = {
+               name      = "argocd"
+               namespace = "argocd"
            }
+           spec       = {
+               selector = {
+                   istio = "ingressgateway"
                }
+               servers  = [
+                   {
+                       hosts = [
+                           "argocd.wayofthesys.com",
                        ]
+                       port  = {
+                           name     = "http"
+                           number   = 80
+                           protocol = "HTTP"
                        }
+                       tls   = {
+                           httpsRedirect = false
                        }
                    },
+                   {
+                       hosts = [
+                           "argocd.wayofthesys.com",
                        ]
+                       port  = {
+                           name     = "https"
+                           number   = 443
+                           protocol = "HTTPS"
                        }
+                       tls   = {
+                           credentialName    = "argocd-tls"
+                           mode              = "SIMPLE"
+                           privateKey        = "/etc/istio/ingressgateway-certs/tls.key"
+                           serverCertificate = "/etc/istio/ingressgateway-certs/tls.crt"
                        }
                    },
                ]
            }
        }
+       object   = {
+           apiVersion = "networking.istio.io/v1beta1"
+           kind       = "Gateway"
+           metadata   = {
+               annotations                = (known after apply)
+               clusterName                = (known after apply)
+               creationTimestamp          = (known after apply)
+               deletionGracePeriodSeconds = (known after apply)
+               deletionTimestamp          = (known after apply)
+               finalizers                 = (known after apply)
+               generateName               = (known after apply)
+               generation                 = (known after apply)
+               labels                     = (known after apply)
+               managedFields              = (known after apply)
+               name                       = "argocd"
+               namespace                  = "argocd"
+               ownerReferences            = (known after apply)
+               resourceVersion            = (known after apply)
+               selfLink                   = (known after apply)
+               uid                        = (known after apply)
            }
+           spec       = {
+               selector = {
+                   "istio" = "ingressgateway"
                }
+               servers  = [
+                   {
+                       bind            = (known after apply)
+                       defaultEndpoint = (known after apply)
+                       hosts           = [
+                           "argocd.wayofthesys.com",
                        ]
+                       name            = (known after apply)
+                       port            = {
+                           name       = "http"
+                           number     = 80
+                           protocol   = "HTTP"
+                           targetPort = (known after apply)
                        }
+                       tls             = {
+                           caCertificates        = (known after apply)
+                           cipherSuites          = (known after apply)
+                           credentialName        = (known after apply)
+                           httpsRedirect         = false
+                           maxProtocolVersion    = (known after apply)
+                           minProtocolVersion    = (known after apply)
+                           mode                  = (known after apply)
+                           privateKey            = (known after apply)
+                           serverCertificate     = (known after apply)
+                           subjectAltNames       = (known after apply)
+                           verifyCertificateHash = (known after apply)
+                           verifyCertificateSpki = (known after apply)
                        }
                    },
+                   {
+                       bind            = (known after apply)
+                       defaultEndpoint = (known after apply)
+                       hosts           = [
+                           "argocd.wayofthesys.com",
                        ]
+                       name            = (known after apply)
+                       port            = {
+                           name       = "https"
+                           number     = 443
+                           protocol   = "HTTPS"
+                           targetPort = (known after apply)
                        }
+                       tls             = {
+                           caCertificates        = (known after apply)
+                           cipherSuites          = (known after apply)
+                           credentialName        = "argocd-tls"
+                           httpsRedirect         = (known after apply)
+                           maxProtocolVersion    = (known after apply)
+                           minProtocolVersion    = (known after apply)
+                           mode                  = "SIMPLE"
+                           privateKey            = "/etc/istio/ingressgateway-certs/tls.key"
+                           serverCertificate     = "/etc/istio/ingressgateway-certs/tls.crt"
+                           subjectAltNames       = (known after apply)
+                           verifyCertificateHash = (known after apply)
+                           verifyCertificateSpki = (known after apply)
                        }
                    },
                ]
            }
        }
    }

  # kubernetes_manifest.argocd_virtualservice will be created
+   resource "kubernetes_manifest" "argocd_virtualservice" {
+       manifest = {
+           apiVersion = "networking.istio.io/v1beta1"
+           kind       = "VirtualService"
+           metadata   = {
+               name      = "argocd"
+               namespace = "argocd"
            }
+           spec       = {
+               gateways = [
+                   "argocd",
                ]
+               hosts    = [
+                   "argocd.wayofthesys.com",
                ]
+               http     = [
+                   {
+                       match = [
+                           {
+                               uri = {
+                                   prefix = "/"
                                }
                            },
                        ]
+                       route = [
+                           {
+                               destination = {
+                                   host = "argocd-server"
+                                   port = {
+                                       number = 80
                                    }
                                }
                            },
                        ]
                    },
                ]
            }
        }
+       object   = {
+           apiVersion = "networking.istio.io/v1beta1"
+           kind       = "VirtualService"
+           metadata   = {
+               annotations                = (known after apply)
+               clusterName                = (known after apply)
+               creationTimestamp          = (known after apply)
+               deletionGracePeriodSeconds = (known after apply)
+               deletionTimestamp          = (known after apply)
+               finalizers                 = (known after apply)
+               generateName               = (known after apply)
+               generation                 = (known after apply)
+               labels                     = (known after apply)
+               managedFields              = (known after apply)
+               name                       = "argocd"
+               namespace                  = "argocd"
+               ownerReferences            = (known after apply)
+               resourceVersion            = (known after apply)
+               selfLink                   = (known after apply)
+               uid                        = (known after apply)
            }
+           spec       = {
+               exportTo = (known after apply)
+               gateways = [
+                   "argocd",
                ]
+               hosts    = [
+                   "argocd.wayofthesys.com",
                ]
+               http     = [
+                   {
+                       corsPolicy       = {
+                           allowCredentials = (known after apply)
+                           allowHeaders     = (known after apply)
+                           allowMethods     = (known after apply)
+                           allowOrigin      = (known after apply)
+                           allowOrigins     = (known after apply)
+                           exposeHeaders    = (known after apply)
+                           maxAge           = (known after apply)
                        }
+                       delegate         = {
+                           name      = (known after apply)
+                           namespace = (known after apply)
                        }
+                       directResponse   = {
+                           body   = {
+                               bytes  = (known after apply)
+                               string = (known after apply)
                            }
+                           status = (known after apply)
                        }
+                       fault            = {
+                           abort = {
+                               grpcStatus = (known after apply)
+                               http2Error = (known after apply)
+                               httpStatus = (known after apply)
+                               percentage = {
+                                   value = (known after apply)
                                }
                            }
+                           delay = {
+                               exponentialDelay = (known after apply)
+                               fixedDelay       = (known after apply)
+                               percent          = (known after apply)
+                               percentage       = {
+                                   value = (known after apply)
                                }
                            }
                        }
+                       headers          = {
+                           request  = {
+                               add    = (known after apply)
+                               remove = (known after apply)
+                               set    = (known after apply)
                            }
+                           response = {
+                               add    = (known after apply)
+                               remove = (known after apply)
+                               set    = (known after apply)
                            }
                        }
+                       match            = [
+                           {
+                               authority       = {
+                                   exact  = (known after apply)
+                                   prefix = (known after apply)
+                                   regex  = (known after apply)
                                }
+                               gateways        = (known after apply)
+                               headers         = (known after apply)
+                               ignoreUriCase   = (known after apply)
+                               method          = {
+                                   exact  = (known after apply)
+                                   prefix = (known after apply)
+                                   regex  = (known after apply)
                                }
+                               name            = (known after apply)
+                               port            = (known after apply)
+                               queryParams     = (known after apply)
+                               scheme          = {
+                                   exact  = (known after apply)
+                                   prefix = (known after apply)
+                                   regex  = (known after apply)
                                }
+                               sourceLabels    = (known after apply)
+                               sourceNamespace = (known after apply)
+                               statPrefix      = (known after apply)
+                               uri             = {
+                                   exact  = (known after apply)
+                                   prefix = "/"
+                                   regex  = (known after apply)
                                }
+                               withoutHeaders  = (known after apply)
                            },
                        ]
+                       mirror           = {
+                           host   = (known after apply)
+                           port   = {
+                               number = (known after apply)
                            }
+                           subset = (known after apply)
                        }
+                       mirrorPercent    = (known after apply)
+                       mirrorPercentage = {
+                           value = (known after apply)
                        }
+                       mirror_percent   = (known after apply)
+                       name             = (known after apply)
+                       redirect         = {
+                           authority    = (known after apply)
+                           derivePort   = (known after apply)
+                           port         = (known after apply)
+                           redirectCode = (known after apply)
+                           scheme       = (known after apply)
+                           uri          = (known after apply)
                        }
+                       retries          = {
+                           attempts              = (known after apply)
+                           perTryTimeout         = (known after apply)
+                           retryOn               = (known after apply)
+                           retryRemoteLocalities = (known after apply)
                        }
+                       rewrite          = {
+                           authority = (known after apply)
+                           uri       = (known after apply)
                        }
+                       route            = [
+                           {
+                               destination = {
+                                   host   = "argocd-server"
+                                   port   = {
+                                       number = 80
                                    }
+                                   subset = (known after apply)
                                }
+                               headers     = {
+                                   request  = {
+                                       add    = (known after apply)
+                                       remove = (known after apply)
+                                       set    = (known after apply)
                                    }
+                                   response = {
+                                       add    = (known after apply)
+                                       remove = (known after apply)
+                                       set    = (known after apply)
                                    }
                                }
+                               weight      = (known after apply)
                            },
                        ]
+                       timeout          = (known after apply)
                    },
                ]
+               tcp      = (known after apply)
+               tls      = (known after apply)
            }
        }
    }

  # kubernetes_manifest.cinema-gateway will be created
+   resource "kubernetes_manifest" "cinema-gateway" {
+       manifest = {
+           apiVersion = "networking.istio.io/v1beta1"
+           kind       = "Gateway"
+           metadata   = {
+               name      = "cinema"
+               namespace = "cinema"
            }
+           spec       = {
+               selector = {
+                   istio = "ingressgateway"
                }
+               servers  = [
+                   {
+                       hosts = [
+                           "wayofthesys.com",
                        ]
+                       port  = {
+                           name     = "http"
+                           number   = 80
+                           protocol = "HTTP"
                        }
+                       tls   = {
+                           httpsRedirect = false
                        }
                    },
+                   {
+                       hosts = [
+                           "wayofthesys.com",
                        ]
+                       port  = {
+                           name     = "https"
+                           number   = 443
+                           protocol = "HTTPS"
                        }
+                       tls   = {
+                           credentialName    = "wayofthesys-com-tls"
+                           mode              = "SIMPLE"
+                           privateKey        = "/etc/istio/ingressgateway-certs/tls.key"
+                           serverCertificate = "/etc/istio/ingressgateway-certs/tls.crt"
                        }
                    },
                ]
            }
        }
+       object   = {
+           apiVersion = "networking.istio.io/v1beta1"
+           kind       = "Gateway"
+           metadata   = {
+               annotations                = (known after apply)
+               clusterName                = (known after apply)
+               creationTimestamp          = (known after apply)
+               deletionGracePeriodSeconds = (known after apply)
+               deletionTimestamp          = (known after apply)
+               finalizers                 = (known after apply)
+               generateName               = (known after apply)
+               generation                 = (known after apply)
+               labels                     = (known after apply)
+               managedFields              = (known after apply)
+               name                       = "cinema"
+               namespace                  = "cinema"
+               ownerReferences            = (known after apply)
+               resourceVersion            = (known after apply)
+               selfLink                   = (known after apply)
+               uid                        = (known after apply)
            }
+           spec       = {
+               selector = {
+                   "istio" = "ingressgateway"
                }
+               servers  = [
+                   {
+                       bind            = (known after apply)
+                       defaultEndpoint = (known after apply)
+                       hosts           = [
+                           "wayofthesys.com",
                        ]
+                       name            = (known after apply)
+                       port            = {
+                           name       = "http"
+                           number     = 80
+                           protocol   = "HTTP"
+                           targetPort = (known after apply)
                        }
+                       tls             = {
+                           caCertificates        = (known after apply)
+                           cipherSuites          = (known after apply)
+                           credentialName        = (known after apply)
+                           httpsRedirect         = false
+                           maxProtocolVersion    = (known after apply)
+                           minProtocolVersion    = (known after apply)
+                           mode                  = (known after apply)
+                           privateKey            = (known after apply)
+                           serverCertificate     = (known after apply)
+                           subjectAltNames       = (known after apply)
+                           verifyCertificateHash = (known after apply)
+                           verifyCertificateSpki = (known after apply)
                        }
                    },
+                   {
+                       bind            = (known after apply)
+                       defaultEndpoint = (known after apply)
+                       hosts           = [
+                           "wayofthesys.com",
                        ]
+                       name            = (known after apply)
+                       port            = {
+                           name       = "https"
+                           number     = 443
+                           protocol   = "HTTPS"
+                           targetPort = (known after apply)
                        }
+                       tls             = {
+                           caCertificates        = (known after apply)
+                           cipherSuites          = (known after apply)
+                           credentialName        = "wayofthesys-com-tls"
+                           httpsRedirect         = (known after apply)
+                           maxProtocolVersion    = (known after apply)
+                           minProtocolVersion    = (known after apply)
+                           mode                  = "SIMPLE"
+                           privateKey            = "/etc/istio/ingressgateway-certs/tls.key"
+                           serverCertificate     = "/etc/istio/ingressgateway-certs/tls.crt"
+                           subjectAltNames       = (known after apply)
+                           verifyCertificateHash = (known after apply)
+                           verifyCertificateSpki = (known after apply)
                        }
                    },
                ]
            }
        }
    }

  # kubernetes_manifest.cinema_bookings_virtualservice will be created
+   resource "kubernetes_manifest" "cinema_bookings_virtualservice" {
+       manifest = {
+           apiVersion = "networking.istio.io/v1beta1"
+           kind       = "VirtualService"
+           metadata   = {
+               name      = "cinema-bookings"
+               namespace = "cinema"
            }
+           spec       = {
+               gateways = [
+                   "cinema",
                ]
+               hosts    = [
+                   "wayofthesys.com",
                ]
+               http     = [
+                   {
+                       match = [
+                           {
+                               uri = {
+                                   prefix = "/api/bookings"
                                }
                            },
                        ]
+                       route = [
+                           {
+                               destination = {
+                                   host = "cinema-bookings"
+                                   port = {
+                                       number = 80
                                    }
                                }
                            },
                        ]
                    },
                ]
            }
        }
+       object   = {
+           apiVersion = "networking.istio.io/v1beta1"
+           kind       = "VirtualService"
+           metadata   = {
+               annotations                = (known after apply)
+               clusterName                = (known after apply)
+               creationTimestamp          = (known after apply)
+               deletionGracePeriodSeconds = (known after apply)
+               deletionTimestamp          = (known after apply)
+               finalizers                 = (known after apply)
+               generateName               = (known after apply)
+               generation                 = (known after apply)
+               labels                     = (known after apply)
+               managedFields              = (known after apply)
+               name                       = "cinema-bookings"
+               namespace                  = "cinema"
+               ownerReferences            = (known after apply)
+               resourceVersion            = (known after apply)
+               selfLink                   = (known after apply)
+               uid                        = (known after apply)
            }
+           spec       = {
+               exportTo = (known after apply)
+               gateways = [
+                   "cinema",
                ]
+               hosts    = [
+                   "wayofthesys.com",
                ]
+               http     = [
+                   {
+                       corsPolicy       = {
+                           allowCredentials = (known after apply)
+                           allowHeaders     = (known after apply)
+                           allowMethods     = (known after apply)
+                           allowOrigin      = (known after apply)
+                           allowOrigins     = (known after apply)
+                           exposeHeaders    = (known after apply)
+                           maxAge           = (known after apply)
                        }
+                       delegate         = {
+                           name      = (known after apply)
+                           namespace = (known after apply)
                        }
+                       directResponse   = {
+                           body   = {
+                               bytes  = (known after apply)
+                               string = (known after apply)
                            }
+                           status = (known after apply)
                        }
+                       fault            = {
+                           abort = {
+                               grpcStatus = (known after apply)
+                               http2Error = (known after apply)
+                               httpStatus = (known after apply)
+                               percentage = {
+                                   value = (known after apply)
                                }
                            }
+                           delay = {
+                               exponentialDelay = (known after apply)
+                               fixedDelay       = (known after apply)
+                               percent          = (known after apply)
+                               percentage       = {
+                                   value = (known after apply)
                                }
                            }
                        }
+                       headers          = {
+                           request  = {
+                               add    = (known after apply)
+                               remove = (known after apply)
+                               set    = (known after apply)
                            }
+                           response = {
+                               add    = (known after apply)
+                               remove = (known after apply)
+                               set    = (known after apply)
                            }
                        }
+                       match            = [
+                           {
+                               authority       = {
+                                   exact  = (known after apply)
+                                   prefix = (known after apply)
+                                   regex  = (known after apply)
                                }
+                               gateways        = (known after apply)
+                               headers         = (known after apply)
+                               ignoreUriCase   = (known after apply)
+                               method          = {
+                                   exact  = (known after apply)
+                                   prefix = (known after apply)
+                                   regex  = (known after apply)
                                }
+                               name            = (known after apply)
+                               port            = (known after apply)
+                               queryParams     = (known after apply)
+                               scheme          = {
+                                   exact  = (known after apply)
+                                   prefix = (known after apply)
+                                   regex  = (known after apply)
                                }
+                               sourceLabels    = (known after apply)
+                               sourceNamespace = (known after apply)
+                               statPrefix      = (known after apply)
+                               uri             = {
+                                   exact  = (known after apply)
+                                   prefix = "/api/bookings"
+                                   regex  = (known after apply)
                                }
+                               withoutHeaders  = (known after apply)
                            },
                        ]
+                       mirror           = {
+                           host   = (known after apply)
+                           port   = {
+                               number = (known after apply)
                            }
+                           subset = (known after apply)
                        }
+                       mirrorPercent    = (known after apply)
+                       mirrorPercentage = {
+                           value = (known after apply)
                        }
+                       mirror_percent   = (known after apply)
+                       name             = (known after apply)
+                       redirect         = {
+                           authority    = (known after apply)
+                           derivePort   = (known after apply)
+                           port         = (known after apply)
+                           redirectCode = (known after apply)
+                           scheme       = (known after apply)
+                           uri          = (known after apply)
                        }
+                       retries          = {
+                           attempts              = (known after apply)
+                           perTryTimeout         = (known after apply)
+                           retryOn               = (known after apply)
+                           retryRemoteLocalities = (known after apply)
                        }
+                       rewrite          = {
+                           authority = (known after apply)
+                           uri       = (known after apply)
                        }
+                       route            = [
+                           {
+                               destination = {
+                                   host   = "cinema-bookings"
+                                   port   = {
+                                       number = 80
                                    }
+                                   subset = (known after apply)
                                }
+                               headers     = {
+                                   request  = {
+                                       add    = (known after apply)
+                                       remove = (known after apply)
+                                       set    = (known after apply)
                                    }
+                                   response = {
+                                       add    = (known after apply)
+                                       remove = (known after apply)
+                                       set    = (known after apply)
                                    }
                                }
+                               weight      = (known after apply)
                            },
                        ]
+                       timeout          = (known after apply)
                    },
                ]
+               tcp      = (known after apply)
+               tls      = (known after apply)
            }
        }
    }

  # kubernetes_manifest.cinema_movies_virtualservice will be created
+   resource "kubernetes_manifest" "cinema_movies_virtualservice" {
+       manifest = {
+           apiVersion = "networking.istio.io/v1beta1"
+           kind       = "VirtualService"
+           metadata   = {
+               name      = "cinema-movies"
+               namespace = "cinema"
            }
+           spec       = {
+               gateways = [
+                   "cinema",
                ]
+               hosts    = [
+                   "wayofthesys.com",
                ]
+               http     = [
+                   {
+                       match = [
+                           {
+                               uri = {
+                                   prefix = "/api/movies"
                                }
                            },
                        ]
+                       route = [
+                           {
+                               destination = {
+                                   host = "cinema-movies"
+                                   port = {
+                                       number = 80
                                    }
                                }
                            },
                        ]
                    },
                ]
            }
        }
+       object   = {
+           apiVersion = "networking.istio.io/v1beta1"
+           kind       = "VirtualService"
+           metadata   = {
+               annotations                = (known after apply)
+               clusterName                = (known after apply)
+               creationTimestamp          = (known after apply)
+               deletionGracePeriodSeconds = (known after apply)
+               deletionTimestamp          = (known after apply)
+               finalizers                 = (known after apply)
+               generateName               = (known after apply)
+               generation                 = (known after apply)
+               labels                     = (known after apply)
+               managedFields              = (known after apply)
+               name                       = "cinema-movies"
+               namespace                  = "cinema"
+               ownerReferences            = (known after apply)
+               resourceVersion            = (known after apply)
+               selfLink                   = (known after apply)
+               uid                        = (known after apply)
            }
+           spec       = {
+               exportTo = (known after apply)
+               gateways = [
+                   "cinema",
                ]
+               hosts    = [
+                   "wayofthesys.com",
                ]
+               http     = [
+                   {
+                       corsPolicy       = {
+                           allowCredentials = (known after apply)
+                           allowHeaders     = (known after apply)
+                           allowMethods     = (known after apply)
+                           allowOrigin      = (known after apply)
+                           allowOrigins     = (known after apply)
+                           exposeHeaders    = (known after apply)
+                           maxAge           = (known after apply)
                        }
+                       delegate         = {
+                           name      = (known after apply)
+                           namespace = (known after apply)
                        }
+                       directResponse   = {
+                           body   = {
+                               bytes  = (known after apply)
+                               string = (known after apply)
                            }
+                           status = (known after apply)
                        }
+                       fault            = {
+                           abort = {
+                               grpcStatus = (known after apply)
+                               http2Error = (known after apply)
+                               httpStatus = (known after apply)
+                               percentage = {
+                                   value = (known after apply)
                                }
                            }
+                           delay = {
+                               exponentialDelay = (known after apply)
+                               fixedDelay       = (known after apply)
+                               percent          = (known after apply)
+                               percentage       = {
+                                   value = (known after apply)
                                }
                            }
                        }
+                       headers          = {
+                           request  = {
+                               add    = (known after apply)
+                               remove = (known after apply)
+                               set    = (known after apply)
                            }
+                           response = {
+                               add    = (known after apply)
+                               remove = (known after apply)
+                               set    = (known after apply)
                            }
                        }
+                       match            = [
+                           {
+                               authority       = {
+                                   exact  = (known after apply)
+                                   prefix = (known after apply)
+                                   regex  = (known after apply)
                                }
+                               gateways        = (known after apply)
+                               headers         = (known after apply)
+                               ignoreUriCase   = (known after apply)
+                               method          = {
+                                   exact  = (known after apply)
+                                   prefix = (known after apply)
+                                   regex  = (known after apply)
                                }
+                               name            = (known after apply)
+                               port            = (known after apply)
+                               queryParams     = (known after apply)
+                               scheme          = {
+                                   exact  = (known after apply)
+                                   prefix = (known after apply)
+                                   regex  = (known after apply)
                                }
+                               sourceLabels    = (known after apply)
+                               sourceNamespace = (known after apply)
+                               statPrefix      = (known after apply)
+                               uri             = {
+                                   exact  = (known after apply)
+                                   prefix = "/api/movies"
+                                   regex  = (known after apply)
                                }
+                               withoutHeaders  = (known after apply)
                            },
                        ]
+                       mirror           = {
+                           host   = (known after apply)
+                           port   = {
+                               number = (known after apply)
                            }
+                           subset = (known after apply)
                        }
+                       mirrorPercent    = (known after apply)
+                       mirrorPercentage = {
+                           value = (known after apply)
                        }
+                       mirror_percent   = (known after apply)
+                       name             = (known after apply)
+                       redirect         = {
+                           authority    = (known after apply)
+                           derivePort   = (known after apply)
+                           port         = (known after apply)
+                           redirectCode = (known after apply)
+                           scheme       = (known after apply)
+                           uri          = (known after apply)
                        }
+                       retries          = {
+                           attempts              = (known after apply)
+                           perTryTimeout         = (known after apply)
+                           retryOn               = (known after apply)
+                           retryRemoteLocalities = (known after apply)
                        }
+                       rewrite          = {
+                           authority = (known after apply)
+                           uri       = (known after apply)
                        }
+                       route            = [
+                           {
+                               destination = {
+                                   host   = "cinema-movies"
+                                   port   = {
+                                       number = 80
                                    }
+                                   subset = (known after apply)
                                }
+                               headers     = {
+                                   request  = {
+                                       add    = (known after apply)
+                                       remove = (known after apply)
+                                       set    = (known after apply)
                                    }
+                                   response = {
+                                       add    = (known after apply)
+                                       remove = (known after apply)
+                                       set    = (known after apply)
                                    }
                                }
+                               weight      = (known after apply)
                            },
                        ]
+                       timeout          = (known after apply)
                    },
                ]
+               tcp      = (known after apply)
+               tls      = (known after apply)
            }
        }
    }

  # kubernetes_manifest.cinema_showtimes_virtualservice will be created
+   resource "kubernetes_manifest" "cinema_showtimes_virtualservice" {
+       manifest = {
+           apiVersion = "networking.istio.io/v1beta1"
+           kind       = "VirtualService"
+           metadata   = {
+               name      = "cinema-showtimes"
+               namespace = "cinema"
            }
+           spec       = {
+               gateways = [
+                   "cinema",
                ]
+               hosts    = [
+                   "wayofthesys.com",
                ]
+               http     = [
+                   {
+                       match = [
+                           {
+                               uri = {
+                                   prefix = "/api/showtimes"
                                }
                            },
                        ]
+                       route = [
+                           {
+                               destination = {
+                                   host = "cinema-showtimes"
+                                   port = {
+                                       number = 80
                                    }
                                }
                            },
                        ]
                    },
                ]
            }
        }
+       object   = {
+           apiVersion = "networking.istio.io/v1beta1"
+           kind       = "VirtualService"
+           metadata   = {
+               annotations                = (known after apply)
+               clusterName                = (known after apply)
+               creationTimestamp          = (known after apply)
+               deletionGracePeriodSeconds = (known after apply)
+               deletionTimestamp          = (known after apply)
+               finalizers                 = (known after apply)
+               generateName               = (known after apply)
+               generation                 = (known after apply)
+               labels                     = (known after apply)
+               managedFields              = (known after apply)
+               name                       = "cinema-showtimes"
+               namespace                  = "cinema"
+               ownerReferences            = (known after apply)
+               resourceVersion            = (known after apply)
+               selfLink                   = (known after apply)
+               uid                        = (known after apply)
            }
+           spec       = {
+               exportTo = (known after apply)
+               gateways = [
+                   "cinema",
                ]
+               hosts    = [
+                   "wayofthesys.com",
                ]
+               http     = [
+                   {
+                       corsPolicy       = {
+                           allowCredentials = (known after apply)
+                           allowHeaders     = (known after apply)
+                           allowMethods     = (known after apply)
+                           allowOrigin      = (known after apply)
+                           allowOrigins     = (known after apply)
+                           exposeHeaders    = (known after apply)
+                           maxAge           = (known after apply)
                        }
+                       delegate         = {
+                           name      = (known after apply)
+                           namespace = (known after apply)
                        }
+                       directResponse   = {
+                           body   = {
+                               bytes  = (known after apply)
+                               string = (known after apply)
                            }
+                           status = (known after apply)
                        }
+                       fault            = {
+                           abort = {
+                               grpcStatus = (known after apply)
+                               http2Error = (known after apply)
+                               httpStatus = (known after apply)
+                               percentage = {
+                                   value = (known after apply)
                                }
                            }
+                           delay = {
+                               exponentialDelay = (known after apply)
+                               fixedDelay       = (known after apply)
+                               percent          = (known after apply)
+                               percentage       = {
+                                   value = (known after apply)
                                }
                            }
                        }
+                       headers          = {
+                           request  = {
+                               add    = (known after apply)
+                               remove = (known after apply)
+                               set    = (known after apply)
                            }
+                           response = {
+                               add    = (known after apply)
+                               remove = (known after apply)
+                               set    = (known after apply)
                            }
                        }
+                       match            = [
+                           {
+                               authority       = {
+                                   exact  = (known after apply)
+                                   prefix = (known after apply)
+                                   regex  = (known after apply)
                                }
+                               gateways        = (known after apply)
+                               headers         = (known after apply)
+                               ignoreUriCase   = (known after apply)
+                               method          = {
+                                   exact  = (known after apply)
+                                   prefix = (known after apply)
+                                   regex  = (known after apply)
                                }
+                               name            = (known after apply)
+                               port            = (known after apply)
+                               queryParams     = (known after apply)
+                               scheme          = {
+                                   exact  = (known after apply)
+                                   prefix = (known after apply)
+                                   regex  = (known after apply)
                                }
+                               sourceLabels    = (known after apply)
+                               sourceNamespace = (known after apply)
+                               statPrefix      = (known after apply)
+                               uri             = {
+                                   exact  = (known after apply)
+                                   prefix = "/api/showtimes"
+                                   regex  = (known after apply)
                                }
+                               withoutHeaders  = (known after apply)
                            },
                        ]
+                       mirror           = {
+                           host   = (known after apply)
+                           port   = {
+                               number = (known after apply)
                            }
+                           subset = (known after apply)
                        }
+                       mirrorPercent    = (known after apply)
+                       mirrorPercentage = {
+                           value = (known after apply)
                        }
+                       mirror_percent   = (known after apply)
+                       name             = (known after apply)
+                       redirect         = {
+                           authority    = (known after apply)
+                           derivePort   = (known after apply)
+                           port         = (known after apply)
+                           redirectCode = (known after apply)
+                           scheme       = (known after apply)
+                           uri          = (known after apply)
                        }
+                       retries          = {
+                           attempts              = (known after apply)
+                           perTryTimeout         = (known after apply)
+                           retryOn               = (known after apply)
+                           retryRemoteLocalities = (known after apply)
                        }
+                       rewrite          = {
+                           authority = (known after apply)
+                           uri       = (known after apply)
                        }
+                       route            = [
+                           {
+                               destination = {
+                                   host   = "cinema-showtimes"
+                                   port   = {
+                                       number = 80
                                    }
+                                   subset = (known after apply)
                                }
+                               headers     = {
+                                   request  = {
+                                       add    = (known after apply)
+                                       remove = (known after apply)
+                                       set    = (known after apply)
                                    }
+                                   response = {
+                                       add    = (known after apply)
+                                       remove = (known after apply)
+                                       set    = (known after apply)
                                    }
                                }
+                               weight      = (known after apply)
                            },
                        ]
+                       timeout          = (known after apply)
                    },
                ]
+               tcp      = (known after apply)
+               tls      = (known after apply)
            }
        }
    }

  # kubernetes_manifest.cinema_users_virtualservice will be created
+   resource "kubernetes_manifest" "cinema_users_virtualservice" {
+       manifest = {
+           apiVersion = "networking.istio.io/v1beta1"
+           kind       = "VirtualService"
+           metadata   = {
+               name      = "cinema-users"
+               namespace = "cinema"
            }
+           spec       = {
+               gateways = [
+                   "cinema",
                ]
+               hosts    = [
+                   "wayofthesys.com",
                ]
+               http     = [
+                   {
+                       match = [
+                           {
+                               uri = {
+                                   prefix = "/api/users"
                                }
                            },
                        ]
+                       route = [
+                           {
+                               destination = {
+                                   host = "cinema-users"
+                                   port = {
+                                       number = 80
                                    }
                                }
                            },
                        ]
                    },
                ]
            }
        }
+       object   = {
+           apiVersion = "networking.istio.io/v1beta1"
+           kind       = "VirtualService"
+           metadata   = {
+               annotations                = (known after apply)
+               clusterName                = (known after apply)
+               creationTimestamp          = (known after apply)
+               deletionGracePeriodSeconds = (known after apply)
+               deletionTimestamp          = (known after apply)
+               finalizers                 = (known after apply)
+               generateName               = (known after apply)
+               generation                 = (known after apply)
+               labels                     = (known after apply)
+               managedFields              = (known after apply)
+               name                       = "cinema-users"
+               namespace                  = "cinema"
+               ownerReferences            = (known after apply)
+               resourceVersion            = (known after apply)
+               selfLink                   = (known after apply)
+               uid                        = (known after apply)
            }
+           spec       = {
+               exportTo = (known after apply)
+               gateways = [
+                   "cinema",
                ]
+               hosts    = [
+                   "wayofthesys.com",
                ]
+               http     = [
+                   {
+                       corsPolicy       = {
+                           allowCredentials = (known after apply)
+                           allowHeaders     = (known after apply)
+                           allowMethods     = (known after apply)
+                           allowOrigin      = (known after apply)
+                           allowOrigins     = (known after apply)
+                           exposeHeaders    = (known after apply)
+                           maxAge           = (known after apply)
                        }
+                       delegate         = {
+                           name      = (known after apply)
+                           namespace = (known after apply)
                        }
+                       directResponse   = {
+                           body   = {
+                               bytes  = (known after apply)
+                               string = (known after apply)
                            }
+                           status = (known after apply)
                        }
+                       fault            = {
+                           abort = {
+                               grpcStatus = (known after apply)
+                               http2Error = (known after apply)
+                               httpStatus = (known after apply)
+                               percentage = {
+                                   value = (known after apply)
                                }
                            }
+                           delay = {
+                               exponentialDelay = (known after apply)
+                               fixedDelay       = (known after apply)
+                               percent          = (known after apply)
+                               percentage       = {
+                                   value = (known after apply)
                                }
                            }
                        }
+                       headers          = {
+                           request  = {
+                               add    = (known after apply)
+                               remove = (known after apply)
+                               set    = (known after apply)
                            }
+                           response = {
+                               add    = (known after apply)
+                               remove = (known after apply)
+                               set    = (known after apply)
                            }
                        }
+                       match            = [
+                           {
+                               authority       = {
+                                   exact  = (known after apply)
+                                   prefix = (known after apply)
+                                   regex  = (known after apply)
                                }
+                               gateways        = (known after apply)
+                               headers         = (known after apply)
+                               ignoreUriCase   = (known after apply)
+                               method          = {
+                                   exact  = (known after apply)
+                                   prefix = (known after apply)
+                                   regex  = (known after apply)
                                }
+                               name            = (known after apply)
+                               port            = (known after apply)
+                               queryParams     = (known after apply)
+                               scheme          = {
+                                   exact  = (known after apply)
+                                   prefix = (known after apply)
+                                   regex  = (known after apply)
                                }
+                               sourceLabels    = (known after apply)
+                               sourceNamespace = (known after apply)
+                               statPrefix      = (known after apply)
+                               uri             = {
+                                   exact  = (known after apply)
+                                   prefix = "/api/users"
+                                   regex  = (known after apply)
                                }
+                               withoutHeaders  = (known after apply)
                            },
                        ]
+                       mirror           = {
+                           host   = (known after apply)
+                           port   = {
+                               number = (known after apply)
                            }
+                           subset = (known after apply)
                        }
+                       mirrorPercent    = (known after apply)
+                       mirrorPercentage = {
+                           value = (known after apply)
                        }
+                       mirror_percent   = (known after apply)
+                       name             = (known after apply)
+                       redirect         = {
+                           authority    = (known after apply)
+                           derivePort   = (known after apply)
+                           port         = (known after apply)
+                           redirectCode = (known after apply)
+                           scheme       = (known after apply)
+                           uri          = (known after apply)
                        }
+                       retries          = {
+                           attempts              = (known after apply)
+                           perTryTimeout         = (known after apply)
+                           retryOn               = (known after apply)
+                           retryRemoteLocalities = (known after apply)
                        }
+                       rewrite          = {
+                           authority = (known after apply)
+                           uri       = (known after apply)
                        }
+                       route            = [
+                           {
+                               destination = {
+                                   host   = "cinema-users"
+                                   port   = {
+                                       number = 80
                                    }
+                                   subset = (known after apply)
                                }
+                               headers     = {
+                                   request  = {
+                                       add    = (known after apply)
+                                       remove = (known after apply)
+                                       set    = (known after apply)
                                    }
+                                   response = {
+                                       add    = (known after apply)
+                                       remove = (known after apply)
+                                       set    = (known after apply)
                                    }
                                }
+                               weight      = (known after apply)
                            },
                        ]
+                       timeout          = (known after apply)
                    },
                ]
+               tcp      = (known after apply)
+               tls      = (known after apply)
            }
        }
    }

  # kubernetes_manifest.cinema_virtualservice will be created
+   resource "kubernetes_manifest" "cinema_virtualservice" {
+       manifest = {
+           apiVersion = "networking.istio.io/v1beta1"
+           kind       = "VirtualService"
+           metadata   = {
+               name      = "cinema"
+               namespace = "cinema"
            }
+           spec       = {
+               gateways = [
+                   "cinema",
                ]
+               hosts    = [
+                   "wayofthesys.com",
                ]
+               http     = [
+                   {
+                       match = [
+                           {
+                               uri = {
+                                   prefix = "/"
                                }
                            },
                        ]
+                       route = [
+                           {
+                               destination = {
+                                   host = "cinema-website"
+                                   port = {
+                                       number = 80
                                    }
                                }
                            },
                        ]
                    },
                ]
            }
        }
+       object   = {
+           apiVersion = "networking.istio.io/v1beta1"
+           kind       = "VirtualService"
+           metadata   = {
+               annotations                = (known after apply)
+               clusterName                = (known after apply)
+               creationTimestamp          = (known after apply)
+               deletionGracePeriodSeconds = (known after apply)
+               deletionTimestamp          = (known after apply)
+               finalizers                 = (known after apply)
+               generateName               = (known after apply)
+               generation                 = (known after apply)
+               labels                     = (known after apply)
+               managedFields              = (known after apply)
+               name                       = "cinema"
+               namespace                  = "cinema"
+               ownerReferences            = (known after apply)
+               resourceVersion            = (known after apply)
+               selfLink                   = (known after apply)
+               uid                        = (known after apply)
            }
+           spec       = {
+               exportTo = (known after apply)
+               gateways = [
+                   "cinema",
                ]
+               hosts    = [
+                   "wayofthesys.com",
                ]
+               http     = [
+                   {
+                       corsPolicy       = {
+                           allowCredentials = (known after apply)
+                           allowHeaders     = (known after apply)
+                           allowMethods     = (known after apply)
+                           allowOrigin      = (known after apply)
+                           allowOrigins     = (known after apply)
+                           exposeHeaders    = (known after apply)
+                           maxAge           = (known after apply)
                        }
+                       delegate         = {
+                           name      = (known after apply)
+                           namespace = (known after apply)
                        }
+                       directResponse   = {
+                           body   = {
+                               bytes  = (known after apply)
+                               string = (known after apply)
                            }
+                           status = (known after apply)
                        }
+                       fault            = {
+                           abort = {
+                               grpcStatus = (known after apply)
+                               http2Error = (known after apply)
+                               httpStatus = (known after apply)
+                               percentage = {
+                                   value = (known after apply)
                                }
                            }
+                           delay = {
+                               exponentialDelay = (known after apply)
+                               fixedDelay       = (known after apply)
+                               percent          = (known after apply)
+                               percentage       = {
+                                   value = (known after apply)
                                }
                            }
                        }
+                       headers          = {
+                           request  = {
+                               add    = (known after apply)
+                               remove = (known after apply)
+                               set    = (known after apply)
                            }
+                           response = {
+                               add    = (known after apply)
+                               remove = (known after apply)
+                               set    = (known after apply)
                            }
                        }
+                       match            = [
+                           {
+                               authority       = {
+                                   exact  = (known after apply)
+                                   prefix = (known after apply)
+                                   regex  = (known after apply)
                                }
+                               gateways        = (known after apply)
+                               headers         = (known after apply)
+                               ignoreUriCase   = (known after apply)
+                               method          = {
+                                   exact  = (known after apply)
+                                   prefix = (known after apply)
+                                   regex  = (known after apply)
                                }
+                               name            = (known after apply)
+                               port            = (known after apply)
+                               queryParams     = (known after apply)
+                               scheme          = {
+                                   exact  = (known after apply)
+                                   prefix = (known after apply)
+                                   regex  = (known after apply)
                                }
+                               sourceLabels    = (known after apply)
+                               sourceNamespace = (known after apply)
+                               statPrefix      = (known after apply)
+                               uri             = {
+                                   exact  = (known after apply)
+                                   prefix = "/"
+                                   regex  = (known after apply)
                                }
+                               withoutHeaders  = (known after apply)
                            },
                        ]
+                       mirror           = {
+                           host   = (known after apply)
+                           port   = {
+                               number = (known after apply)
                            }
+                           subset = (known after apply)
                        }
+                       mirrorPercent    = (known after apply)
+                       mirrorPercentage = {
+                           value = (known after apply)
                        }
+                       mirror_percent   = (known after apply)
+                       name             = (known after apply)
+                       redirect         = {
+                           authority    = (known after apply)
+                           derivePort   = (known after apply)
+                           port         = (known after apply)
+                           redirectCode = (known after apply)
+                           scheme       = (known after apply)
+                           uri          = (known after apply)
                        }
+                       retries          = {
+                           attempts              = (known after apply)
+                           perTryTimeout         = (known after apply)
+                           retryOn               = (known after apply)
+                           retryRemoteLocalities = (known after apply)
                        }
+                       rewrite          = {
+                           authority = (known after apply)
+                           uri       = (known after apply)
                        }
+                       route            = [
+                           {
+                               destination = {
+                                   host   = "cinema-website"
+                                   port   = {
+                                       number = 80
                                    }
+                                   subset = (known after apply)
                                }
+                               headers     = {
+                                   request  = {
+                                       add    = (known after apply)
+                                       remove = (known after apply)
+                                       set    = (known after apply)
                                    }
+                                   response = {
+                                       add    = (known after apply)
+                                       remove = (known after apply)
+                                       set    = (known after apply)
                                    }
                                }
+                               weight      = (known after apply)
                            },
                        ]
+                       timeout          = (known after apply)
                    },
                ]
+               tcp      = (known after apply)
+               tls      = (known after apply)
            }
        }
    }

Plan: 8 to add, 1 to change, 0 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:gcp/prod workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```

## Cost Estimation
**Total Monthly Difference: 248.11 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| gcp/prod | default | 0.00 | 248.11 | 248.11|
| | **Total** | **0.00** | **248.11** | **248.11** |
</details>

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
